//#define _CRT_SECURE_NO_WARNINGS
////5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
////A选手说：B第二，我第三；
////B选手说：我第二，E第四；
////C选手说：我第一，D第二；
////D选手说：C最后，我第三；
////E选手说：我第四，A第一；
////比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//#include<stdio.h>
//int main()
//	{
//	int a, b, c, d, e = 0;
//	for (a = 1; a <= 5 ; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e < 5; e++)			   //上面的循环就是因为我们不知道这个选手的话究竟是哪里是真的哪一个又是假的那么我们就将所有的可能都列出来
//					{
//						if (a * b * c * d * e == 120)  //这句代码非常的关键如果没有这句代码我们就会打印出多组结果因为我们没有将一个位置只能有一个人占据给考虑进去这句代码就是
//													   //将这个考虑给带入进去如果不加这个就会出现一个名词有两个人或几个人占据的情况这里我们假设a为1b为2c为3d为4e为5相乘得120
//						{
//								if((a == 3) + (b == 2) == 1 &&
//								(b == 2) + (e == 4) == 1 &&
//								(c == 1) + (d == 2) == 1 &&
//								(d == 3) + (c == 5) == 1 &&
//								(e == 4) + (a == 1))
//								{
//									printf("a名次：%d b名次：%d c名次：%d d名次：%d e名次：%d,", a, b, c, d, e);
//								}
//						}
//						
//					}
//				}
//			}
//		}
//	}
//	return 0;
//	}